n5/src/Catalogs/VAT/VAT.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>VAT</name>
  <attributes>
    <name>Rate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sorting</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.VAT</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Enums/VAT/VAT.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>VAT</name>
  <enumValues>
    <name>Standart</name>
  </enumValues>
  <enumValues>
    <name>Reduced</name>
  </enumValues>
  <enumValues>
    <name>Zero</name>
  </enumValues>
  <enumValues>
    <name>None</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/VAT/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Rate enable not inlist ( Object.Type, Enum.VAT.Zero, Enum.VAT.None )
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure TypeOnChange ( Item )
	
	resetRate ();
	Appearance.Apply ( ThisObject, "Object.Type" );
	
EndProcedure

&AtClient
Procedure resetRate ()
	
	type = Object.Type;
	if ( type = PredefinedValue ( "Enum.VAT.Zero" )
		or type = PredefinedValue ( "Enum.VAT.None" ) ) then
		Object.Rate = 0;
	endif; 
	
EndProcedure 

&AtClient
Procedure RateOnChange ( Item )
	
	setDescription ();
	
EndProcedure

&AtClient
Procedure setDescription ()
	
	Object.Description = "" + Object.Rate + "%";
	
EndProcedure
